In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [3]:
premise_file = "../Resources/LicensePremise.csv"
premise_df = pd.read_csv(premise_file)
premise_df.head()

,License Serial Number,Premises Name,License Certificate Number,License Received Date,County ID Code
0,1311660,CANA ARRIBA GROCERY NO 2 INC,NaN,2018-06-29T00:00:00,0
1,1310023,JOHANA GROCERY & DELI CORP,NaN,2018-04-27T00:00:00,0
2,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
3,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
4,1311663,181 LEXINGTON AVENUE BBQ LLC,NaN,2018-06-29T00:00:00,2

In [4]:
county_file = "../Resources/CountyLicenseCount.csv"
county_df = pd.read_csv(county_file)
county_df.head()

   ID County Name (Licensee)  County ID Code  License Count
0   0                 ALBANY               5             77
1   1               ALLEGANY              59              4
2   2                  BRONX               0            104
3   3                 BROOME              35             14
4   4            CATTARAUGUS              41              9

### Transform premise DataFrame

In [11]:
new_premise_df = premise_df[["License Serial Number", "Premises Name", "County ID Code"]].\
    rename(columns={"License Serial Number": "id", "Premises Name": "premise_name", "County ID Code": "county_id"}).\
    drop_duplicates().set_index("id")
new_premise_df.head()

                         premise_name  county_id
id
1311660  CANA ARRIBA GROCERY NO 2 INC          0
1310023    JOHANA GROCERY & DELI CORP          0
1310024             TKO BEVERAGES LLC          1
1311663  181 LEXINGTON AVENUE BBQ LLC          2
1310029        AZIZ DELI & GRILL CORP          1

### Transform county DataFrame

In [12]:
new_county_df = county_df[["ID", "County Name (Licensee)", "License Count", "County ID Code"]].\
    rename(columns={"ID": "id", "County Name (Licensee)": "county_name", "License Count": "license_count", "County ID Code": "county_id"}).\
    set_index("id")
new_county_df.head()

    county_name  license_count  county_id
id
0        ALBANY             77          5
1      ALLEGANY              4         59
2         BRONX            104          0
3        BROOME             14         35
4   CATTARAUGUS              9         41

### Create database connection

In [14]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/customer_db')

In [15]:
# Confirm tables
engine.table_names()

['premise', 'county']

### Load DataFrames into database

In [18]:
new_premise_df.to_sql(name="premise", con=engine, index=True, if_exists="append")

In [19]:
new_county_df.to_sql(name="county", con=engine, index=True, if_exists="append")